In [2]:
import pandas as pd

In [4]:
import seaborn as sns

In [7]:
df = sns.load_dataset("iris")
type(df)

pandas.core.frame.DataFrame

In [13]:
df.index

RangeIndex(start=0, stop=150, step=1)

In [27]:
names = ["Om","Anuj","Sahil","Arkan","Amadeus"]
ages = [18,19,20,17,1]
d = {
    "name": names,
    "age" : ages
}
se = pd.Series(names)
df = pd.DataFrame(d)
df

      name  age
0       Om   18
1     Anuj   19
2    Sahil   20
3    Arkan   17
4  Amadeus    1

In [31]:
import numpy as np

In [57]:
data = np.random.randint(1,10,(5,5))
data = pd.DataFrame(data,columns=["a","b","c","e","f"])
data

   a  b  c  e  f
0  8  5  9  8  4
1  4  3  6  3  6
2  7  7  3  6  9
3  1  1  5  4  2
4  7  6  9  9  6

In [58]:
data["g"]=0
data.describe()

              a         b         c        e         f    g
count  5.000000  5.000000  5.000000  5.00000  5.000000  5.0
mean   5.400000  4.400000  6.400000  6.00000  5.400000  0.0
std    2.880972  2.408319  2.607681  2.54951  2.607681  0.0
min    1.000000  1.000000  3.000000  3.00000  2.000000  0.0
25%    4.000000  3.000000  5.000000  4.00000  4.000000  0.0
50%    7.000000  5.000000  6.000000  6.00000  6.000000  0.0
75%    7.000000  6.000000  9.000000  8.00000  6.000000  0.0
max    8.000000  7.000000  9.000000  9.00000  9.000000  0.0

In [60]:
data.sort_values(["a"])

   a  b  c  e  f  g
3  1  1  5  4  2  0
1  4  3  6  3  6  0
2  7  7  3  6  9  0
4  7  6  9  9  6  0
0  8  5  9  8  4  0

In [62]:
data.iloc[:2,:2]

   a  b
0  8  5
1  4  3